import * as React from "react";
import Box from "@mui/material/Box";
import Typography from "@mui/material/Typography";
import Modal from "@mui/material/Modal";
import { Button, Grid } from "@mui/material";

export default function Footer() {
  const [open, setOpen] = React.useState(false);
  const handleOpen = () => setOpen(true);
  const handleClose = () => setOpen(false);

  return (
    <Grid container>
      <Grid
        item
        className="bg-[#f0f0f0] w-full mt-20 py-5 text-center flex flex-col"
      >
        <b className="text-[13px] my-2">حقوق النشر © 2025 جميع الحقوق محفوظة</b>
        <a
          onClick={handleOpen}
          className="text-xs px-4 text-[#1a73e8] underline hover:text-black cursor-pointer"
        >
          privacy policy
        </a>
      </Grid>
      <Modal
        open={open}
        onClose={handleClose}
        aria-labelledby="modal-modal-title"
        aria-describedby="modal-modal-description"
      >
        <Box
          sx={{
            position: "absolute",
            top: "50%",
            left: "50%",
            transform: "translate(-50%, -50%)",
            width: { xs: 360, sm: 440, md: 600 },
            bgcolor: "background.paper",
            boxShadow: 24,
            py: 2,
            px: 3,
            maxHeight: 570,
            overflowY: "auto",
            borderRadius: 2,
            border: "1px solid #6d6a6a",
          }}
        >
          <Typography
            id="modal-modal-title"
            sx={{
              fontWeight: "bold",
            }}
            textAlign={"center"}
            variant="h6"
            component="h2"
          >
            سياسة الأمن و الخصوصية
          </Typography>
          <p
            id="modal-modal-description"
            style={{
              lineHeight: 2,
              fontSize: "15px",
              marginTop: "20px",
            }}
          >
            تلتزم دائرة الشؤون القانونية بحماية حقوق جميع زوار هذا الموقع. إننا
            نلتزم بالحفاظ على سرية المعلومات الحساسة، ولذا أعددنا هذا الإعلان
            الخاص بالأمن والخصوصية للإفصاح عن النهج الذي نتبعه في جمع المعلومات
            ونشرها على موقعنا الإلكتروني هذا.
            <br />
            <b
              style={{
                fontSize: 18,
              }}
            >
              جمع واستخدام المعلومات الإلكترونية
            </b>
            <br /> يعمل السيرفر الخاص بنا، تلقائياً، على التقاط عنوان بروتوكول
            الإنترنت الخاص بك عند زيارتك الموقع. (عنوان بروتوكول الإنترنت الخاص
            بك هو الرقم الخاص بجهاز الكمبيوتر الذي تستخدمه، والذي يسمح للأجهزة
            الأخرى الموصولة بشبكة الإنترنت بتحديد وجهة البيانات الصادرة عنها،
            لكن من دون تعرف هويتك الشخصية).
            <br /> إن استخدامنا بروتوكول الإنترنت الخاص بك يساعدنا على تشخيص
            المشكلات التي تحدث في السيرفر الخاص بنا، وعلى إجراء الإحصاء اللازم
            لقياس معدل استخدام الموقع، ونحن لا نسمح لأي جهة خارج إطار الفريق
            الفني لدائرة الشؤون القانونية بالاطلاع على بروتوكول الإنترنت الخاص
            بك.
            <br /> ومن أجل تقديم خدمة أفضل وموقع إلكتروني أكثر فاعلية، يمكن لبعض
            أقسام هذا الموقع استخدام برامج الكوكي (cookies) كجزء من التفاعل مع
            متصفحك. إن برنامج الكوكي هو عبارة عن ملف نصي صغير (عادة ما يكون بحجم
            بضعة بايتات) نرسله إلى القرص الصلب الخاص بك ليتمكن سيرفرنا من تعرف
            كمبيوترك.
            <br /> لن يقوم الكوكي المرسل من قبلنا بمحاولة قراءة أي من المعلومات
            الموجودة على قرصك الصلب، ونحن لا نقوم بتجميع المعلومات المتأتية من
            خلال برامج الكوكي مع معلومات شخصية أخرى من أجل تحديد هويتك أو عنوان
            بريدك الإلكتروني.
            <br /> عند زيارتك بعض أجزاء هذا الموقع ربما يطلب منك تقديم معلومات
            شخصية للتعريف بهويتك (مثل الاسم، و رقم الهاتف، والبريد الإلكتروني ،
            )، وهي كلها معلومات ضرورية لإتمام معاملتك. غير أن رقم بطاقتك لن يتم
            تخزينه مطلقاً وتحت أي ظرف. لكن في حال رفضك تقديم تلك المعلومات، فإنك
            تحد من قدرتنا على خدمتك. لكننا في كل الأحوال نستمر في دعوتنا لك
            لزيارة موقعنا والاستفادة من المعلومات القيمة التي يوفرها.
            <br />
            <b
              style={{
                fontSize: 18,
              }}
            >
              انتقال آمن للمعلومات
            </b>
            <br /> ندعوك للاطمئنان بأن هذا الموقع يحوز إجراءات أمن تحمي
            المعلومات التي تقدمها لنا. ومن جهتنا فنحن نعمل على تشفير المعلومات
            التي تعتبر حساسة أو البيانات التي يتعين الحفاظ على سريتها توافقاً مع
            المتطلبات القانونية.
            <br /> حماية المعلومات الشخصية
            <br /> لن تكون معلوماتك الشخصية متاحة إلا لموظفي دائرة الشؤون
            القانونية الذين هم يحتاجون فعلاً إلى الاطلاع عليها. ولن تكون تلك
            المعلومات متاحة لاطّلاع العموم من غير موافقتك. وعلاوة على ذلك لن يتم
            تبادل، أو تداول، أي من تلك المعلومات أو بيعها لأي طرف آخر من غير
            موافقتك المسبقة. ولن يجري السماح بالوصول إلى المعلومات إلا لأولئك
            المؤهلين والمحترفين الذين يتولون تقديم خدمات دائرة الشؤون القانونية
            التي تتناسب مع تعاملاتك مع موقعنا.
            <br /> الحق في معاينة البيانات الشخصية أو تعديلها أو تصحيحها.
          </p>
          <Grid
            container
            sx={{
              display: "flex",
              flexDirection: "row-reverse",
            }}
          >
            <Grid item xs={12} sm={5}>
              <Button
                variant="contained"
                fullWidth
                sx={{
                  backgroundColor: "#1565c0 !important",
                  fontSize: 17,
                  boxShadow: 3,
                  mt: 3,
                }}
                onClick={handleClose}
              >
                لقد فهمت
              </Button>
            </Grid>
          </Grid>
        </Box>
      </Modal>
    </Grid>
  );
}
